use std::io::{self, Write};

pub fn draw(track: &Vec<Vec<String>>){
    clearscreen::clear().expect("failed to clear screen");
    for row in track {
        print!("{}", "Lane [ ");
        for cell in row {
            print!("{}", cell)
        }
        println!(" ]");
    }
}

pub fn print_start() {
    clearscreen::clear().expect("failed to clear screen");
    let logo = r#"
██████╗ ██╗   ██╗███████╗████████╗██╗   ██╗     ██████╗  █████╗ ██╗██╗     ███████╗
██╔══██╗██║   ██║██╔════╝╚══██╔══╝╚██╗ ██╔╝     ██╔══██╗██╔══██╗██║██║     ██╔════╝
██████╔╝██║   ██║███████╗   ██║    ╚████╔╝█████╗██████╔╝███████║██║██║     ███████╗
██╔══██╗██║   ██║╚════██║   ██║     ╚██╔╝ ╚════╝██╔══██╗██╔══██║██║██║     ╚════██║
██║  ██║╚██████╔╝███████║   ██║      ██║        ██║  ██║██║  ██║██║███████╗███████║
╚═╝  ╚═╝ ╚═════╝ ╚══════╝   ╚═╝      ╚═╝        ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝╚══════╝╚══════╝"#;
    println!("{}", logo);
    print!("Press [ENTER] to start simulation...");
    io::stdout().flush().unwrap();
    let mut _pause = String::new();
    io::stdin().read_line(&mut _pause).unwrap();
    clearscreen::clear().expect("failed to clear screen");
}