use std::io::{self, Write};
use crate::train::Train;

pub fn draw(){
    const ROW : usize = 60;
    const COL : usize = 7;

    let mut track: Vec<Vec<String>> = vec![vec!["=".to_string(); ROW]; COL];

    for (i, lane) in track.iter().enumerate() {
        print!("Lane {:02} [", i);

        for segment in lane {
            print!("{}", segment);
        }
        println!("]");
    }
}

pub fn print_start() {
    clearscreen::clear().expect("failed to clear screen");
    let logo = r#"
██████╗ ██╗   ██╗███████╗████████╗██╗   ██╗     ██████╗  █████╗ ██╗██╗     ███████╗
██╔══██╗██║   ██║██╔════╝╚══██╔══╝╚██╗ ██╔╝     ██╔══██╗██╔══██╗██║██║     ██╔════╝
██████╔╝██║   ██║███████╗   ██║    ╚████╔╝█████╗██████╔╝███████║██║██║     ███████╗
██╔══██╗██║   ██║╚════██║   ██║     ╚██╔╝ ╚════╝██╔══██╗██╔══██║██║██║     ╚════██║
██║  ██║╚██████╔╝███████║   ██║      ██║        ██║  ██║██║  ██║██║███████╗███████║
╚═╝  ╚═╝ ╚═════╝ ╚══════╝   ╚═╝      ╚═╝        ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝╚══════╝╚══════╝"#;
    println!("{}", logo);
    print!("Press [ENTER] to start simulation...");
    io::stdout().flush().unwrap();
    let mut _pause = String::new();
    io::stdin().read_line(&mut _pause).unwrap();
    clearscreen::clear().expect("failed to clear screen");
}